Creating Data Frames Using Series:

A Pandas Series is like a column in a table. It is a one-dimensional array holding data of any type.

In [2]:
import pandas as pd

In [ ]:
# class pandas.Series(data=none,index=none,dtype=none)

In [203]:
pd.Series()

Series([], dtype: object)

Create series from list:

In [205]:
s = pd.Series([1,2,"AI", "ML"], index = ["A","B","C","D"])

In [206]:
s

A     1
B     2
C    AI
D    ML
dtype: object

In [207]:
s.size, s.shape, s.ndim

(4, (4,), 1)

In [6]:
import numpy as np

s = pd.Series([1,2,"AI", "ML"], index = np.arange(1,8,2))

In [209]:
s

1     1
3     2
5    AI
7    ML
dtype: object

Q) A teacher wishes to store the names of the students along with their roll numbers or serial numbers in the proper format. How can you help the teacher to accomplish this task? How will Series help you solve it?

In [211]:
s = pd.Series(["AI", "ML"], index = np.arange(1,3))

In [212]:
s

1    AI
2    ML
dtype: object

Create series using random and arange function, 10 students Mark list in Series:

Modify the index of series:

In [10]:
name = ["AI", "ML"]

stu = pd.Series(np.random.randint(70,86,2),index=name)

stu

AI    82
ML    76
dtype: int32

In [216]:
stu = pd.Series(np.random.randint(70,86,2))
stu

0    84
1    83
dtype: int32

In [217]:
stu.index = name

In [218]:
stu

AI    84
ML    83
dtype: int32

An e-commerce company wants to represent the customer IDs which consist of alphanumeric characters, with their spending scores (1-100). How can you accomplish this task?

Converting a dictionary object into Series type

In [221]:
dic = {'rollno': 512, 'name':"AI", "marks":75}

In [222]:
pd.Series(dic)

rollno    512
name       AI
marks      75
dtype: object

Slicing:

In [224]:
stu

AI    84
ML    83
dtype: int32

In [225]:
s = pd.Series(np.random.randint(100,10000,100), index = np.arange(1,101))

In [226]:
s

1      3198
2      1642
3      1414
4      9640
5      9424
       ...
96      968
97     2376
98     8532
99     8985
100    4111
Length: 100, dtype: int32

In [227]:
s[:]  #To print all the values

1      3198
2      1642
3      1414
4      9640
5      9424
       ...
96      968
97     2376
98     8532
99     8985
100    4111
Length: 100, dtype: int32

In [228]:
s[0:3]  #First 3 rows

1    3198
2    1642
3    1414
dtype: int32

In [229]:
s[0:30:2]

1     3198
3     1414
5     9424
7     9632
9     7165
11     992
13    6658
15    1123
17    1476
19    3009
21    2947
23    6904
25    3271
27    4335
29    7002
dtype: int32

How can you retrieve the first five elements and the last three elements from the above data?

Consider the series "S2" that represents the Customer ID and Spending score (1-100) of the customers of an e-commerce company. The company wants to know the records of the customers with customer IDs from A3 to A5. How can you accomplish this task?

Consider the series "Ser", that represents the names and annual salaries of the employees of the company. A company wants to find out the names of the employees whose salary is more than 26,000 USD and less than 29,000 USD. How can you accomplish this task?

In [18]:
s = pd.Series(np.random.randint(10000,45000,50), index = np.arange(1,51))

In [20]:
s

1     22723
2     18106
3     13684
4     21711
5     40407
6     11998
7     16250
8     25713
9     20626
10    28988
11    31124
12    25716
13    35226
14    21436
15    18028
16    36368
17    31349
18    28482
19    18751
20    17367
21    43387
22    38973
23    19529
24    35022
25    14205
26    38947
27    23286
28    21722
29    41771
30    13723
31    35850
32    26743
33    15806
34    33228
35    12796
36    29649
37    23313
38    14824
39    26989
40    30969
41    40745
42    22322
43    29458
44    26126
45    44372
46    19799
47    15214
48    15916
49    39830
50    12069
dtype: int32

In [22]:
s = s[(s>26000)&(s<29000)]

In [24]:
s

10    28988
18    28482
32    26743
39    26989
44    26126
dtype: int32

In [26]:
s.index

Index([10, 18, 32, 39, 44], dtype='int32')

In [237]:
s = s*1.2

In [238]:
s

1     31755.6
3     31508.4
26    31700.4
47    31953.6
dtype: float64

In [239]:
s.sort_values()

3     31508.4
26    31700.4
1     31755.6
47    31953.6
dtype: float64

In [240]:
s.sort_values(ascending=False)

47    31953.6
1     31755.6
26    31700.4
3     31508.4
dtype: float64

In [241]:
s.sort_values(ascending=False, ignore_index = True)

0    31953.6
1    31755.6
2    31700.4
3    31508.4
dtype: float64

To add new data into an existing series

1) Append

2) Concat

In [243]:
s

1     31755.6
3     31508.4
26    31700.4
47    31953.6
dtype: float64

In [244]:
s1 = pd.Series(np.random.randint(30000,45000,5), index = np.arange(1,6))

In [245]:
s1

1    33870
2    39702
3    31799
4    35377
5    37723
dtype: int32

In [246]:
#s.append(s1)

In [247]:
s = pd.concat([s,s1])

In [248]:
dup = s.copy()   #TO copy the series

In [249]:
dup

1     31755.6
3     31508.4
26    31700.4
47    31953.6
1     33870.0
2     39702.0
3     31799.0
4     35377.0
5     37723.0
dtype: float64

Calculate Mean, Sum, Min , Max:

In [251]:
s.mean()     #Average

33932.11111111111

In [252]:
s.sum()

305389.0

In [253]:
s.min()

31508.399999999998

In [254]:
s.max()

39702.0

Identify the employees who are paid below the average salary of all the employees.

In [256]:
s[s.between(31000, 33000)]

1     31755.6
3     31508.4
26    31700.4
47    31953.6
3     31799.0
dtype: float64

In [257]:
s.sort_index()

1     31755.6
1     33870.0
2     39702.0
3     31508.4
3     31799.0
4     35377.0
5     37723.0
26    31700.4
47    31953.6
dtype: float64

In [258]:
s.update(pd.Series([27854, 29547], index = [23,24]))

In [259]:
s

1     31755.6
3     31508.4
26    31700.4
47    31953.6
1     33870.0
2     39702.0
3     31799.0
4     35377.0
5     37723.0
dtype: float64

In [260]:
s.sort_index(inplace = True)

In [261]:
s

1     31755.6
1     33870.0
2     39702.0
3     31508.4
3     31799.0
4     35377.0
5     37723.0
26    31700.4
47    31953.6
dtype: float64

In [262]:
#s.drop(24, inplace = True)

In [263]:
s

1     31755.6
1     33870.0
2     39702.0
3     31508.4
3     31799.0
4     35377.0
5     37723.0
26    31700.4
47    31953.6
dtype: float64

In [264]:
s1 = pd.Series([1,2,3])
s2 = pd.Series([4,5,6])

In [265]:
s1+s2

0    5
1    7
2    9
dtype: int64

In [266]:
s1.add(s2)

0    5
1    7
2    9
dtype: int64

In [267]:
s2-s1

0    3
1    3
2    3
dtype: int64

In [268]:
s1.value_counts()

1    1
2    1
3    1
Name: count, dtype: int64

DataFrame

In [270]:
#pd.DataFrame(data, index, columns, dtype)

In [271]:
df = pd.DataFrame([1,2,3], columns=['Number'])

In [272]:
df

   Number
0       1
1       2
2       3

In [273]:
df = pd.DataFrame(s)

In [274]:
df.columns = ['salary']

In [275]:
df

     salary
1   31755.6
1   33870.0
2   39702.0
3   31508.4
3   31799.0
4   35377.0
5   37723.0
26  31700.4
47  31953.6

In [36]:
dic = {'Mobile_Brands': ['Redmi', 'Apple', 'Samsumg', 'Vivo'],
       'Price': [15000, 60000, 40000, 30000]}

In [38]:
df = pd.DataFrame(dic)

In [40]:
df

  Mobile_Brands  Price
0         Redmi  15000
1         Apple  60000
2       Samsumg  40000
3          Vivo  30000

In [42]:
df = pd.DataFrame()

df['Mobile_Brands'] = ['Redmi', 'Apple', 'Samsumg', 'Vivo']
df['Price'] = [15000, 60000, 40000, 30000]

In [44]:
df

  Mobile_Brands  Price
0         Redmi  15000
1         Apple  60000
2       Samsumg  40000
3          Vivo  30000

A teacher wants to create a table that contains information about students' roll_no from 1 to 10, student_name, and percentage. How can you accomplish this task using pandas dataframe?

Slicing in Data Frame:

2 Types of Slicing:

1) One slicing with respect to row: iloc

2) another is with respect to column: loc

In [293]:
df.iloc[[1]]

  Mobile_Brands  Price
1         Apple  60000

In [318]:
df.loc[[1],"Price"]

1    60000
Name: Price, dtype: int64

In [46]:
df.iloc[1:3] #It will not include the upper limit

  Mobile_Brands  Price
1         Apple  60000
2       Samsumg  40000

In [287]:
df.loc[1:3]

  Mobile_Brands  Price
1         Apple  60000
2       Samsumg  40000
3          Vivo  30000

In [288]:
df.loc[[2], 'Mobile_Brands']

2    Samsumg
Name: Mobile_Brands, dtype: object

In [ ]:
df

In [ ]:
import pandas